# Luke Riechert
## Week13 11/19/2020
### Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [3]:
#mapping
df = DataFrame({'city':['Alma','Brian Head','Foxpark','Lake Mary'], 
               'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2     Foxpark      9062
3   Lake Mary      8966

In [4]:
st_map={'Alma':'CO','Brian Head':'UT','Foxpark':'WY','Lake Mary':'CA'}
st_map

{'Alma': 'CO', 'Brian Head': 'UT', 'Foxpark': 'WY', 'Lake Mary': 'CA'}

In [5]:
df['state'] = df['city'].map(st_map)

df

         city  altitude state
0        Alma     10355    CO
1  Brian Head      9800    UT
2     Foxpark      9062    WY
3   Lake Mary      8966    CA

In [6]:
#apply
def meter(x):
    return x / 3.3808

In [7]:
df['altitude'] = df['altitude'].apply(meter)

df

         city     altitude state
0        Alma  3062.884524    CO
1  Brian Head  2898.722196    UT
2     Foxpark  2680.430667    WY
3   Lake Mary  2652.035021    CA

In [8]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT', 'OH', 'TX', 'OR'])

df

           b         d         e
UT  0.193410 -0.282719 -1.832958
OH -1.214630 -0.199596 -0.082689
TX -0.611739 -0.953292 -0.263215
OR -0.119235 -0.559306  1.122041

In [11]:
def dif(x):
    return x.max() - x.min()

In [12]:
df.apply(dif)

b    1.408041
d    0.753696
e    2.955000
dtype: float64

In [13]:
df.apply(dif, axis=1)

UT    2.026369
OH    1.131941
TX    0.690076
OR    1.681347
dtype: float64

In [15]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.832958  0.0  0.0  1.0
-1.214630  1.0  0.0  0.0
-0.953292  0.0  1.0  0.0
-0.611739  1.0  0.0  0.0
-0.559306  0.0  1.0  0.0
-0.282719  0.0  1.0  0.0
-0.263215  0.0  0.0  1.0
-0.199596  0.0  1.0  0.0
-0.119235  1.0  0.0  0.0
-0.082689  0.0  0.0  1.0
 0.193410  1.0  0.0  0.0
 1.122041  0.0  0.0  1.0

In [16]:
#groupby
df = DataFrame({'k1': ['a','a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})

df

  k1   k2  dataset1  dataset2
0  a  one  0.273863 -0.823450
1  a  two -0.359616 -1.079267
2  b  one  0.386997 -1.504250
3  b  two -0.771778 -0.567874
4  c  one  0.527207 -0.340744

In [17]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [18]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [19]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [20]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.273863 -0.823450
1  a  two -0.359616 -1.079267
2  b  one  0.386997 -1.504250
3  b  two -0.771778 -0.567874
4  c  one  0.527207 -0.340744

In [21]:
df['dataset1'].groupby(df['k1']).mean()

k1
a   -0.042877
b   -0.192391
c    0.527207
Name: dataset1, dtype: float64

In [22]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a  -0.042877 -0.951359
b  -0.192391 -1.036062
c   0.527207 -0.340744

In [23]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.273863 -0.823450
   two -0.359616 -1.079267
b  one  0.386997 -1.504250
   two -0.771778 -0.567874
c  one  0.527207 -0.340744

In [24]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.mean()

        dataset1
k1 k2
a  one  0.273863
   two -0.359616
b  one  0.386997
   two -0.771778
c  one  0.527207